openfoam/stepflow_flap/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 10.7539;


boundaryField
{    
    INLET
    {
        type            fixedValue;
        value           $internalField;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    "(FRONT|BACK)"
    {
        type            empty;
    }

    "(UP|DOWN)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
