openfoam/stepflow_flap/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

rho             [1 -3 0 0 0 0 0] 1.0;

nu              [0 2 -1 0 0 0 0] 2e-4;  //  1.5384615384615e-05;  // mu:1.6e-05; [nu = mu/rho]

// ************************************************************************* //
