openfoam/stepflow_flap/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    INLET
    {
        type            patch;
        nFaces          100;
        startFace       42620;
    }
    OUTLET
    {
        type            patch;
        nFaces          100;
        startFace       42720;
    }
    UP
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          230;
        startFace       42820;
    }
    DOWN
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          330;
        startFace       43050;
    }
    FRONT
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21500;
        startFace       43380;
    }
    BACK
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21500;
        startFace       64880;
    }
)

// ************************************************************************* //
